[
        {
            "id": "1",
            "author": "femi",
            "title": "GitHub launches Actions, its workflow automation tool",
            "description": "For the longest time, GitHub was all about storing source code and sharing it either with the rest of the world or your colleagues. Today, the company, which is in the process of being acquired by Microsoft, is taking a step in a different but related directi…",
            "urlToImage":  "https://techcrunch.com/wp-content/uploads/2018/10/IMG_20181016_092551.jpg?w=533",
            "publishedAt": "2018-10-16",
            "content": "For the longest time, GitHub was all about storing source code and sharing it either with the rest of the world or your colleagues. Today, the company, which is in the process of being acquired by Microsoft, is taking a step in a different but related direction by launching GitHub Actions. Actions allow developers to not just host code on the platform but also run it. We’re not talking about a new cloud to rival AWS here, but instead about something more akin to a very flexible IFTTT for developers who want to automate their development workflows, whether that is sending notifications or building a full continuous integration and delivery pipeline. This is a big deal for GitHub . Indeed, Sam Lambert, GitHub’s head of platform, described it to me as “the biggest shift we’ve had in the history of GitHub.” He likened it to shortcuts in iOS — just more flexible. “Imagine an infinitely more flexible version of shortcut, hosted on GitHub and designed to allow anyone to create an action inside a container to augment and connect their workflow.” GitHub users can use Actions to build their continuous delivery pipelines, and the company expects that many will do so. And that’s pretty much the first thing most people will think about when they hear about this new project. GitHub’s own description of Actions in today’s announcement makes definitely fits that bill, too. “Easily build, package, release, update, and deploy your project in any language—on GitHub or any external system—without having to run code yourself,” the company writes. But it’s about more than that.“I see CI/CD as one narrow use case of actions. It’s so, so much more,” Lambert stressed. “And I think it’s going to revolutionize DevOps because people are now going to build best in breed deployment workflows for specific applications and frameworks, and those become the de facto standard shared on GitHub. […] It’s going to do everything we did for open source again for the DevOps space and for all those different parts of that workflow ecosystem. That means you can use it to send a text message through Twilio every time someone uses the ‘urgent issue’ tag in your repository, for example. Or you can write a one-line command that searches your repository with a basic grep command. Or really run any other code you want to because all you have to do to turn any code in your repository into an Action is to write a Docker file for it so that GitHub can run it. “As long as there is a Docker file, we can build it, run in and connect it to your workflow,” Lambert explained. If you don’t want to write a Docker file, though, there’s also a visual editor you can use to build your workflow. As Corey Wilkerson, GitHub’s head of product engineering also noted, many of these Actions already exist in repositories on GitHub today. And there are now over 96 million of those on GitHub, so that makes for a lot of potential actions that will be available from the start. With Actions, which is now in limited public beta, developers can set up the workflow to build, package, release, update and deploy their code without having to run the code themselves. Now developers could host those Actions themselves — they are just Docker containers, after all — but GitHub will also host and run the code for them. "
        },
        {
            "id": "2",
            "author": "karen",
            "title": "Update: Sony Says It's Fixed Malicious PS4 Message Exploit",
            "description": "PS4 messaging's short reign of terror is apparently over.",
            "urlToImage": "https://assets2.ignimgs.com/2016/11/04/ps4pro1280jpg-f4857f_1280w.jpg",
            "publishedAt": "2018-10-16",
            "content": "Over the weekend, PlayStation 4 users began reporting their consoles were being rendered inoperable upon opening certain PSN messages. Sony has since acknowledged the exploit and told IGN it’s 'planning a system software update to resolve this problem.' The issue seemingly began this past Saturday, October 13, when reports of the message exploit spread across the internet. In the initial Reddit post, user Huntstark said they received an unsolicited message from a Rainbow Six Siege opponent that 'basically' bricked their console, though Sony says systems aren't technically being bricked, but rather sent into a 'crash loop.' Other PS4 users then chimed in, saying their consoles were similarly affected by the same message. According to user accounts, the malicious messages all contain a box filled with a question mark (presumably a character the system can’t recognize) set between the same Spanish word and emoji. The problem apparently lies within this specific character combination. As Kotaku notes, a similar text-based exploit was used to crash iPhones several years ago. Those who haven’t been affected by the message exploit can still take preventative measures until Sony releases the aforementioned system update. As suggested by user tizorres in another Reddit thread, PS4 players are encouraged to go into their privacy settings and set their messaging preference to 'Friends' or 'No One.' We’ll be sure to update you when Sony announces a release date for the patch. In the meantime, you can catch up on some other recent news from the world of PlayStation, including official PSN name changes and Sony’s confirmation of a next-gen console."
        },
        {
            "id": "3",
            "author": "tunde",
            "title": "Inside the Huge Arrow Twist We Didn't See Coming",
            "description": "Arrow's Season 7 premiere sets up a major change that will have lasting repercussions for the rest of the show. New showrunner Beth Schwartz explains what's behind the show's new direction.",
            "urlToImage": "https://assets1.ignimgs.com/2018/10/16/arrow-season-7-premiere-1539648399066_1280w.jpg",
            "publishedAt": "2018-10-16",
            "content": "Arrow spent its first five seasons telling the story of Oliver Queen's evolution from a spoiled rich kid into a hardened vigilante through flashbacks to his time on Lian Yu - but in the Season 7 premiere, the superhero show introduces a new twist on the plot device, flashing forward in time to offer a different hero's journey. We see a mystery man traveling to Lian Yu in the midst of a brutal storm - only coming to realize at the episode's end that we've jumped forward in time, and we're seeing Oliver's son, William, all grown up. He's seeking out an older Roy Harper, who has apparently been living on the island, and it seems like William hasn't seen his father, or Roy, for quite some time. New showrunner Beth Schwartz says the flash forwards will be a season-long arc, much as they were in the first five seasons - and that they'll continue to play out for as long as the show remains on the air: 'We always knew after Season 5 there [wouldn't] be flashbacks, so we had talked about doing flash-forwards years ago, like 'is this what we're gonna do when there aren't flashbacks?' So we're gonna keep it all season and series.' Schwartz says the timeframe of the flash-forwards is around 20 years in the future, but we can still expect to see William in the present-day storyline, despite being sent away by Felicity to keep him safe from Diaz. 'Part of what I think made this series so successful in having the flashbacks is that you were able to really get into your characters - especially with Oliver, you knew how he became the way he is,' she says. 'And now with the flash-forwards, you're able to see what is happening in the present day, how that affects the characters in the future. Which is really, really, really fun creatively to tell those stories."
        },
        {
            "id": "4",
            "author": "andrew",
            "title": "Call of Duty: Black Ops 4 Players Are Using Emotes to Look Around Corners in Blackout",
            "description": "Blackout, Call of Duty: Black Ops 4’s battle royale mode, has been impacted by players taking advantage of the emote system to look around corners to gain an advantage.",
            "urlToImage": "https://assets1.ignimgs.com/2018/10/15/blackout-1539642915594_1280w.jpg",
            "publishedAt": "2018-10-16",
            "content": "Blackout, Call of Duty: Black Ops 4’s battle royale mode, has been impacted by players taking advantage of its emote system to look around corners and gain an advantage. As reported by Kotaku (via VG247) players are breaking this mode by using emotes (officially called gestures) to pull the camera out into the third person in order to get a tactical view of their surroundings.Black Ops 4, like all mainline Call of Duty games, is a first-person shooter, meaning any advantage gained by looking around corners can be hugely helpful to some players, but particularly annoying and harmful to those on the receiving end. A couple of gestures are useful for manipulating the camera, like the Point gesture which animates for a particularly long time, and the Sitting Bull gesture, which doesn’t automatically return the player to a first-person perspective and allows them to rotate the camera indefinitely. Developer Treyarch issued an official statement on its official launch-day post on Reddit, saying 'We’re aware that players have been able to use Gestures to peek around corners in modes where that can create an unfair advantage. We’re currently working on an update that creates two systems for Gestures – the default system that is in the game now, and a competitive version that disables free look and applies different camera settings to prevent using it to see around corners'. 'The default system will be used in parts of the game where corner peeking won’t affect gameplay balance (like the staging area of Blackout), and the competitive version will be used in modes where a more restrictive camera system is needed. We want players to always have fun with Gestures as intended, but never at the expense of fair gameplay!' As of now, no solid timeframe for a patch to fix this issue has been announced, though it and other patch changes appear to point towards Treyarch actively listening to the community to improve the game."
        },
        {
            "id": "5",
            "author": "kemi",
            "title": "Tom and Jerry: Live-Action Animation Hybrid Movie in the Works From Fantastic Four Director",
            "description": "The Hanna-Barbera classic cartoon Tom and Jerry will be receiving a live-action/animated hybrid feature film, and Warner Bros. is in negotiations with Tim Story to Direct.",
            "urlToImage": "https://assets1.ignimgs.com/2018/10/15/tom-and-jerry-1539636738127_1280w.jpg",
            "publishedAt": "2018-10-16",
            "content": "The Hanna-Barbera classic cartoon duo Tom and Jerry will be receiving a live-action/animated hybrid feature film, and Warner Bros. is in negotiations with Tim Story to Direct. As reported by Variety, the film is expected to begin shooting in 2019. Story is known for directing 2005’s Fantastic Four and Fantastic Four: Rise of the Silver Surfer, as well as Ride Along and the upcoming Shaft film. It appears that the production will shoot real-world footage with Tom and Jerry themselves being added in as animation - similar to how films like Who Framed Roger Rabbit handled the process. Reports claim the two main characters won’t be voiced and will operate mostly with physical comedy, just as the pair did in their original outings. Warner Bros. is reportedly looking to make sure that the live-action and animation teams are working together over the course of this film and other similar hybrid projects. Other films coming out of Warner Animation Group include the Space Jam sequel starring LeBron James, a Cat in the Hat animated feature, and a Scooby-Doo film with Chris Columbus (director of the first two Home Alone and Harry Potter films) as creative producer - Scooby is expected to be released in the first quarter of 2020. Previous films that have come out of Warner Animation Group include The Lego Movie and its spin-offs, Storks and Smallfoot."
        },
        {
            "id": "6",
            "author": "ayo",
            "title": "Elon Musk's settlement with the SEC approved by judge, sending shares higher",
            "description": "The saga between Tesla CEO Elon Musk and the U.S. Securities and Exchange Commission, which began with a now infamous “funding secured” tweet about taking the electric automaker private, is officially resolved. A federal judge has approved Musk’s settlement w…",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/06/GettyImages-930534182.jpeg?w=559",
            "publishedAt": "2018-10-16",
            "content": "The saga between Tesla  CEO Elon Musk and the U.S. Securities and Exchange Commission, which began with a now infamous “funding secured” tweet about taking the electric automaker private, is officially resolved. A federal judge has approved Musk’s settlement with the SEC over securities fraud allegations. Bloomberg was the first to report the judge’s approval. Tesla shares jumped more than 4 percent on the news. The SEC alleged in a complaint filed in September that Musk lied when he tweeted on August 7 that he had “funding secured” for a private takeover of the company at $420 per share. Federal securities regulators reportedly served Tesla with a subpoena just a week after the tweet. The SEC filed a complaint alleging securities fraud six weeks later. The complaint was filed after Musk and Tesla’s board abruptly walked away from an agreement with the SEC. The board not only pulled out of the agreement, it issued a bold statement of support for Musk after the charges were filed. The NYT reported that Musk had given an ultimatum to the board and threatened to resign if the board pushed him to settle. A settlement was eventually reached anyway, albeit with stiffer penalties than the original agreement. However, this problematic chapter in Tesla’s history wasn’t over despite the two parties reaching a settlement. An order by U.S. District Judge Alison Nathan asked the SEC and Tesla to submit a joint letter explaining why the court should approve the consent judgment. The joint letter was filed October 11. Nathan determined the consent judgment was “fair and reasonable,” and approved it Tuesday. Musk agreed, in the settlement reached on September 29, to step down as chairman of Tesla and pay a $20 million fine. Musk is supposed to resign from his role as chairman of the Tesla board within 45 days of the agreement. He cannot seek reelection or accept an appointment as chairman for three years. An independent chairman will be appointed, under the settlement agreement. Tesla agreed to pay a separate $20 million penalty, according to the SEC. The SEC said the charge and fine against Tesla is for failing to require disclosure controls and procedures relating to Musk’s tweets."
        },
        {
            "id":"7",
            "author": "bryson",
            "title": "With Watch GT, Huawei ditches Google for its own OS",
            "description": "LG’s strange new hybrid Watch W7 marked a small but important victory for Wear OS. But this morning in London, Google lost a key ally in the smartwatch wars — for this model, at least. Huawei’s latest wearable, the Watch GT ditches the Google operating system…",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/10/HUAWEI-WATCH-GT_1.jpg?w=518",
            "publishedAt": "2018-10-16",
            "content": "LG’s strange new hybrid Watch W7 marked a small but important victory for Wear OS. But this morning in London, Google lost a key ally in the smartwatch wars — for this model, at least. Huawei’s latest wearable, the Watch GT ditches the Google operating system for its own in-house brew, LiteOS. The move marks a blow for Google’s struggling wearable operating system. The company has made a point of avoiding fragmentation for Wear OS, a decision that may ultimately haunt the company as manufacturers like Samsung, Fitbit and now Huawei go it on their own. Each manufacturer has their own reasons, of course, but Huawei, the decision is pretty straightforward. Namely, the company wants to squeeze as much battery out of this as possible. That’s in keeping with a day’s announcements that also included a phone that can charge other phones, mind. Here, that means some pretty outrageous claims. Huawei says the thing gets two weeks on a charge with standard use, which seems downright silly compared to the competition. If you turn off all of the distractions, meanwhile, you can apparently get up to 30 days, which is essentially Kindle territory we’re talking about here. The watch is a bit beefy, as you no doubt expected. That’s going to be a bit of a drawback, given the watch’s focus on fitness. As is the fact that, well, most of the competition has also made fitness the centerpiece of their products — Apple and Fitbit are going to be tough to topple. There’s continuous heart rate monitoring on-board, along with a built-in tri-GPS system for more accurate run tracking. As with its new phone, the Huawei looks firmly aimed at Samsung’s marketshare in the watch category, and that’s apparently meant leaving Wear OS in the dust."
        },
        {
            "id": "8",
            "author": "amaka",
            "title": "Walmart’s Vudu may add subscription video channels to its streaming service",
            "description": "Walmart appears to have big plans for its video streaming service, Vudu. On the heels of a partnership with MGM for original content, new reports claim the retailer is now in discussions with various video services, in the hopes of making them accessible thro…",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/10/vudu-homepage.png?w=698",
            "publishedAt": "2018-10-16",
            "content": "Walmart  appears to have big plans for its video streaming service, Vudu . On the heels of a partnership with MGM for original content, new reports claim the retailer is now in discussions with various video services, in the hopes of making them accessible through Vudu itself. That move would make Vudu more like Amazon’s Prime Video Channels, an offering that allows customers to pick and choose which streaming service subscriptions they want to access through Prime Video. The news was first reported by AdAge and Bloomberg, with both reporting that the types of services that could arrive on Vudu as add-on subscriptions include HBO NOW, Showtime and Starz. The talks are still in the very early stages, the reports claim. If Walmart chooses to go this route with Vudu, it shouldn’t be too difficult to get these deals done. As more consumers cut the cord with traditional pay TV, premium cable TV networks need new ways to achieve distribution. Even the broadcaster CBS has ventured into over-the-top subscriptions, with CBS All Access, a service that offers live TV, on-demand series, and original programming like the new “Star Trek” series, which is only accessible to its cord cutting audience. It would not be an unusual step for Vudu to include add-on subscriptions – most live TV streaming services do today, as well as marketplaces like Prime Video Channels, and even on-demand streamers like Hulu. What is interesting, however, is that Walmart is now paying attention to Vudu, whose potential it has overlooked for years. Vudu hasn’t received a major new feature since the launch of “Movies on Us” two years ago. That brought a free streaming movie channel to the service, similar to the new Roku Channel. But for the most part, Vudu’s audience are viewers looking for movie rentals and purchases, not streaming content. That could ultimately prove a challenge for Vudu, as consumers associate the brand with purchases, not subscriptions. They may not think to ever check Vudu for signing up to something like HBO or Showtime. Walmart has also been rumored to be considering its own Netflix competitor, which could help fill out a new streaming offering in the future."
        },
        {
            "id": "9",
            "author": "tomisin",
            "title": "Huawei’s new phone can wirelessly charge the competition",
            "description": "Make no mistake, Huawei’s going after the big dogs here. The company’s taken a Samsung-esque approach to the world of flagship smartphones with a beast of a handset that delivers everything and the kitchen sink. The Mate 20 Pro is a 6.4 inch powerhouse with f…",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/10/huawei.jpg?w=600",
            "publishedAt": "2018-10-16",
            "content": "Make no mistake, Huawei’s going after the big dogs here. The company’s taken a Samsung-esque approach to the world of flagship smartphones with a beast of a handset that delivers everything and the kitchen sink. The Mate 20 Pro is a 6.4 inch powerhouse with features and specs to spare. It’s a combination of the genuinely useful and the just sort of novel, but the hardware maker has clearly spared no expense getting itself on the global map with this thing. There’s a lot to unpack here, but the most compelling feature of the set may well be the device’s wireless charging. While that’s not particularly exciting on the face of it, get this, the company is confident enough about the on-board battery that you can use it to wirelessly charge the competition. I’m not sure how practical that will be for a majority of users, but as someone who has multiple phones on his person most days, I’ve  found myself in a handful of scenarios where pulling a little extra juice from the phone’s massive 4,200mAh battery. The phone itself, naturally, has quick charging capabilities, hitting 70 percent battery after 30 minutes. You’ve also got three cameras on the back, because Huawei. They’re all smushed together a square design, which the company says was inspired by sports cars. Sure, why not? There’s a 20-megapixel lens for super wide shots, a 40 megapixel standard shooter and an eight megapixel telephoto. Oh, and those in-screen fingerprint readers everyone’s talking about? There’s one here, too, along with a depth-sensing face unlock for added security. The depth detecting front-facing cameras are also being put to use for things like image scanning and, yes, 3D selfies. Inside is the proprietary Kirin 980 processor the company’s been talking up since way back at IFA. Huawei says its chip is able to eke out better performance than Qualcomm’s premium Snapdragon, but we’ll wait for the benchmarks for that one. And Huawei, like Apple, has been investing a lot in on-board AI processing, which is certainly on display here."
        },
        {
            "id": "10",
            "author": "femi",
            "title": "Journal raises $1.5 million to bring Google-like search to your personal life",
            "description": "In today’s world of Slack, email and a gazillion other web apps and services, it’s become increasingly hard to search for information. Did your boss Slack you or email you that information about your bonus? Or did they share it via a Google Doc? Who knows? Cl…",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/08/GettyImages-503737790.jpg?w=483",
            "publishedAt": "2018-10-16",
            "content": "In today’s world of Slack, email and a gazillion other web apps and services, it’s become increasingly hard to search for information. Did your boss Slack you or email you that information about your bonus? Or did they share it via a Google Doc? Who knows? Clearly not you, but Journal  knows. Journal,  a machine learning and natural language processing-powered platform designed to search across all your web services and tools, today announced a $1.5 million seed round led by Social Capital. Since receiving the funding about a year ago, Journal has been able to launch a beta community of users. Today, Journal is publicly launching its Mac app, web app and Chrome extension. “We’re passionate about helping people use information effectively,” Journal co-founder and CEO Samiur Rahman told TechCrunch. “In this case, we want to help people manage their knowledge. So we want to help individuals to leverage all of the places that they have information right now.” It was that thesis that led Rahman and his team to land on wanting to build a suite of tools that “acts as a second brain for people. That’s obviously a long way away but that’s what our long-term vision is.” Based on the demo Rahman showed me, Journal looks pretty darn useful. I had an opportunity to install it, but I was hesitant to do so. That’s because Journal requires viewing permissions to your email, apps and other services with which you sync Journal. That’s scary for a couple of reasons — the main one being privacy. For example, what happens if Journal gets hacked? Or if the government requests data from Journal? Well, Journal uses zero-knowledge encryption that ensures Journal employees can’t read or decrypt the information of the user. As with most tech products these days, it comes down to how much do you trust the company and how much do you care about your data? And depending on who you are, you may have a stronger threat model — that is, what threats you face based on who you are. Black communities, for example, are at a greater risk of surveillance by the government than white communities. So you adjust your behavior based on your personal threats. Privacy concerns aside, Journal looks like a really useful product. But we’ll see if I get around to setting it up."
        },
        {
            "id": "11",
            "author":"ayo",
            "title": "The new Kindle Paperwhite is thinner and waterproof",
            "description": "The Voyage may be dead, but the Kindle line still has some life left in it. This time last year, Amazon upgraded the high-end Oasis model, and now the mid-range Paperwhite is getting a little love.The workhorse of the company’s devoted e-reader line just got …",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/10/CMB_4796.jpg?w=600",
            "publishedAt": "2018-10-16",
            "content": "The Voyage may be dead, but the Kindle line still has some life left in it. This time last year, Amazon upgraded the high-end Oasis model, and now the mid-range Paperwhite is getting a little love.The workhorse of the company’s devoted e-reader line just got a handful of upgrades that will give users a more premium experience, while keeping the device’s starting price at $130. Waterproofing is the most exciting among the upgrades here. Remember that time four years ago when we ran a story with the headline, “This Waterproof Kindle Paperwhite Is Humanity’s Greatest Achievement?” Well, this is that potential fulfilled — now directly from Amazon. The reader sports an IPX8 rating, meaning it can be dunked in two meters of water for up to an hour. That bit comes, in part, courtesy of another key upgrade. Like the Oasis before it, the reader sports a flush front, rather than the raised bezels found on older, cheaper models. The move gives the model an overall more premium feel and should help keep water from invading its circuits. It also goes a ways toward making this the thinnest and lightest Paperwhite, as well. Another key change is the bump from four LEDs to five. Seems like a small thing, but it goes a ways toward keeping the front lighting more uniform across the board, versus the more patchy consistency found in earlier models. Performance should be roughly the same on this model, though storage has been doubled to 8GB. There’s a 32GB model as well, for those who really aren’t into cloud storage. That move comes largely because the model is also getting Bluetooth, so users can listen to audio books through Audible using the device. The Whispersync feature makes sure users are up to date with both the text and audio versions. There are a couple of tweaks to the software, including an updated home page with more customized recommendations, along with the ability to save different setting profiles. Pre-orders start today, and the new Paperwhite will begin shipping November 9. That $130 version includes Special Offers (ads), which Amazon says most customers are still opting into. Prices go up from there."
        },
        {
            "id": "12",
            "author": "andrew",
            "title": "Man United and Tottenham Reportedly Track Nathan Ake Amid Chelsea Rumours",
            "description": "Manchester United and Tottenham Hotspur are reportedly interested in signing  Nathan Ake  from Bournemouth, although it's added they would potentially have to wait on a decision from Chelsea before successfully signing the Dutchman...",
            "urlToImage": "https://img.bleacherreport.net/img/images/photos/003/769/421/hi-res-1ad32561e09399c843140dbea8f36ada_crop_exact.jpg?w=1200&h=1200&q=75",
            "publishedAt": "2018-10-16",
            "content": "Manchester United and Tottenham Hotspur are reportedly interested in signing Nathan Ake from Bournemouth, although it's added they would potentially have to wait on a decision from Chelsea before successfully signing the Dutchman. According to Matt Law of the Daily Telegraph, both the Red Devils and Spurs are said to have been impressed by Ake early in the campaign and will continue keeping tabs on him for the rest of the 2018-19 term. However, it's reported there is a 'gentleman's agreement' between Chelsea and Bournemouth following the player's move to the Vitality Stadium in 2017 that the Stamford Bridge side would be able to bring Ake back to the club for £40 million. 'There has not yet been any sign that Chelsea are ready to try to take Ake back to Stamford Bridge and any move to re-sign him would have to be agreed by the player,' said Law. 'But a summer bid from either Spurs or United would force Bournemouth to offer Chelsea the opportunity to make a move and leave the other two clubs sweating.' It's added that the Blues have similar agreements in place with other players who left the club in the same summer, including Lyon's Bertrand Traore and Watford's Nathaniel Chalobah. While Bournemouth supporters wouldn't have worried too much about losing the 23-year-old for £40 million at the time of the transfer, the inflation in the market and the performances of Ake may have them concerned going into the summer window. He has been crucial to Bournemouth's bright start to the season, providing a rock-solid presence at the base of the team. Ake has sharp defensive instincts, enjoys a physical battle and is rarely bullied when it comes to aerial duels either. In addition, he's a technical footballer, offering a composed presence in the middle of defence and as a left-sided player, brings vital balance to the team too. Those qualities make it understandable that some of the biggest teams in the Premier League would be interested in Ake. United, in particular, have big issues in defence, and manager Jose Mourinho has made some curious selections in that area. According to Law it is still anticipated that Toby Alderweireld will leave Spurs soon, meaning they may be on the lookout for another centre-back. Chelsea, meanwhile, are said to have question marks over the long-term futures of David Luiz, Gary Cahill and Andreas Christensen. Even so, having struggled to get a game with the Blues in the past and blossomed during his time at Bournemouth, perhaps Ake would think twice about making another move any time soon."
        }
    ]